Config/Documents/СводнаяЗаявкаНаКассовыйРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СводнаяЗаявкаНаКассовыйРасход</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БезналичныеДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНалогаИлиПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНалоговИПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Comment>Вид платежа (электронно, почтой, телеграфом)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВтораяПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВтораяПодписьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВтораяПодписьПечататьДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКлассификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КБКНазначениеПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБКНалога</Name>
					<Comment>Код бюджетной классификации доходов РФ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЦели</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУНазначениеПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяПодписьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяПодписьПечататьДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредельнаяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Comment>Статус составителя платежного документа на перечисление налогов, сборов и иных обязательных платежей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННПлательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОКАТО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентБанковскийСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентБИКБанка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентКорСчетБанка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентКПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентНаименование</Name>
							<Comment>Наименование получателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентНаименованиеБанка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>160</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПППлательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалогСборПлатеж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалогиИПлатежиОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательДаты</Name>
							<Comment>Дата документа - основания перечисления  налога, сбора или иного платежа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательНомера</Name>
							<Comment>Номер документа - основания перечисления  налога, сбора или иного платежа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательОснования</Name>
							<Comment>Условное обозначение основания налогового платежа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПериода</Name>
							<Comment>Условное обозначение периода, за который перечисляется налог</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательТипа</Name>
							<Comment>Условное обозначение типа налогового платежа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>210</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПримечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКонтрагента</Name>
							<Comment>Счет контрагента - получателя платежа</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВидаДохода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ТипыЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЛицевыхСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Казначейский</Name>
					<Comment>Лицевой счет открыт в органе казначейства или финансовом органе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Счет открыт в учреждении банка, кредитной организации или на едином казначейском счете</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/СводнаяЗаявкаНаКассовыйРасход/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ЭтоНоваяСтрока;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.РеквизитыЛицевогоСчета) Тогда
			
			ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию();
			
		Иначе
			
			ПриИзмененииЛицевогоСчета();
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Элементы.ИсточникСредств.СписокВыбора.ЗагрузитьЗначения(ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(Объект.ЛицевойСчет));
	
	ПлатежноРасчетныеДокументы.ЗаполнитьДопустимыеКФОиИсточникиСредств(Объект.ЛицевойСчет,СписокДопустимыхКФО,СписокИсточниковСредствПоКФО);
	ПлатежноРасчетныеДокументы.ЗаполнитьСписокВыбораКодовДохода(Элементы.РасшифровкаПлатежаКодВидаДохода);
	
	СвойстваЛицевогоСчета = ПлатежноРасчетныеДокументыПовтИсп.ПолучитьСвойстваЛицевогоСчета(Объект.ЛицевойСчет, Объект.Дата);
	
	Если ЗначениеЗаполнено(Объект.ВидНалогаИлиПлатежа) Тогда
		
		НалоговыеНастройки = БухгалтерскийУчет.ПолучитьНастройкиВидаНалоговогоПлатежа(Объект.ВидНалогаИлиПлатежа, Объект.Дата, Объект.Организация);
		
		ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем = НалоговыеНастройки.ЗаполнятьНезаполненныеНулем;
		ТаможенныйПлатеж = НалоговыеНастройки.ТаможенныйПлатеж;
		РеквизитыПлатежа = Новый Структура("СтатусСоставителя", Объект.СтатусСоставителя);
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, БухгалтерскийУчетКлиентСервер.ПолучитьЗначенияНалоговыхРеквизитов(Новый Структура("СтатусСоставителя", Объект.СтатусСоставителя)));

	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ИННКПП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Организация, "ИНН, КПП");
		ИННПлательщика = ИННКПП.ИНН;
		КПППлательщика = ИННКПП.КПП;
		
	КонецЕсли;	

	
	РазницаИтогаТЧ = Объект.РасшифровкаПлатежа.Итог("Сумма") - Объект.СуммаДокумента;

	ЗаполнитьТекстовыеКолонкиРасшифровки();
	
	УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЛицевойСчет, "МаксДлинаНазначенияПлатежа");
	
	ПлатежноРасчетныеДокументы.ПриСозданииНаСервереФормыДокумента(ЭтаФорма);

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ,
													 СтандартнаяОбработка, 
													 Элементы.БухгалтерскаяОперация, 
													 Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	    
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ЗаполнитьТекстовыеКолонкиРасшифровки();
	
    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части

	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма,
												   ТекущийОбъект, 
												   Элементы.БухгалтерскаяОперация, 
												   Элементы.ДополнительныеТабличныеЧасти);
    // Конец Типовые операции и дополнительные табличные части
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьРеквизитовОрганизации(); 
	УстановленнаяДлинаНазначенияПлатежаКлиент();
	
	БухгалтерскиеОперацииКлиент.ПриОткрытии(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.ВводРеквизитовНалоговогоПлатежа") Тогда
		
		ОбработкаВыбораНалоговыхРеквизитовНаКлиенте(ВыбранноеЗначение);
		
	ИначеЕсли ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.РедактированиеПлатежныхРеквизитов") Тогда
		
		ОбработкаВыбораРеквизитовПолучателяНаКлиенте(ВыбранноеЗначение);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ПлатежноРасчетныеДокументы.ПередЗаписьюНаСервереДокумента(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.РасшифровкаПлатежа.Итог("Сумма") <> Объект.СуммаДокумента тогда
		
		ТекстСообщения = НСтр("ru = 'Сумма документа не совпадает с суммой расшифровки'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "РасшифровкаПлатежа",, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	ПлатежноРасчетныеДокументыКлиент.ОбработатьОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

    БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперации()
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере()
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		
		//Если НЕ СвойстваЛицевогоСчета.НеЗаполнятьПредельнуюДатуИсполнения Тогда
		//	
		//	Объект.ПредельнаяДатаИсполнения = КонецДня(Объект.Дата) + СвойстваЛицевогоСчета.ПредельныйСрокИсполненияЗаявок;
		//	
		//КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановленнаяДлинаНазначенияПлатежаКлиент();
	УстановитьДоступностьРеквизитовОрганизации();
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	ПриИзмененииЛицевогоСчета();
	УстановленнаяДлинаНазначенияПлатежаКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Организация, ТекущаяСтрока, ТипЛицевогоСчета, НаДату", Объект.Организация, Объект.РеквизитыЛицевогоСчета, ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Казначейский"), Объект.Дата);
	ОткрытьФорму("Справочник.РеквизитыЛицевыхСчетов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.РеквизитыЛицевогоСчета 	= ВыбранноеЗначение;
	ПолучитьЛицевойСчетОрганКазначейства();  
	
	УстановленнаяДлинаНазначенияПлатежаКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерваяПодписьПриИзменении(Элемент)
	Объект.ПерваяПодписьДолжность =  УстановитьДолжность(Объект.ПерваяПодпись, Объект.ПерваяПодписьПечататьДолжность, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ВтораяПодписьПриИзменении(Элемент)
	Объект.ВтораяПодписьДолжность =  УстановитьДолжность(Объект.ВтораяПодпись, Объект.ВтораяПодписьПечататьДолжность, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ВтораяПодписьПечататьДолжностьПриИзменении(Элемент)
	Объект.ВтораяПодписьДолжность =  УстановитьДолжность(Объект.ВтораяПодпись, Объект.ВтораяПодписьПечататьДолжность, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПерваяПодписьПечататьДолжностьПриИзменении(Элемент)
	Объект.ПерваяПодписьДолжность =  УстановитьДолжность(Объект.ПерваяПодпись, Объект.ПерваяПодписьПечататьДолжность, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура НалогСборПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВидНалогаИлиПлатежа) Тогда
		
		НалогСборПриИзмененииНаСервере(); 
		
	Иначе
		
		ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем = Ложь;
		ТаможенныйПлатеж = Ложь;
		Объект.СтатусСоставителя = "";
		ПолеВводаСтатусСоставителя = "";
		Объект.КодБКНалога = "";
		
	КонецЕсли;
	
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура НалогСборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.РасшифровкаПлатежа.Количество() > 0 И НЕ ВыбранноеЗначение = Объект.ВидНалогаИлиПлатежа Тогда
		
		СтандартнаяОбработка = Ложь;
		
		НовыйНалог = ВыбранноеЗначение;
		ОписаниеОповещения = Новый ОписаниеОповещения("НалогСборИзменениеЗавершение", ЭтотОбъект, НовыйНалог);

		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Будет выполнена очистка таблицы раздела 2. Продолжить?'"), 
		РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет, ,КодВозвратаДиалога.Нет);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогСборОчистка(Элемент, СтандартнаяОбработка)
	
	Если Объект.РасшифровкаПлатежа.Количество() Тогда
		
		СтандартнаяОбработка = Ложь;
		
		НовыйНалог = ПредопределенноеЗначение("Справочник.ВидыНалоговИПлатежей.ПустаяСсылка");

		ОписаниеОповещения = Новый ОписаниеОповещения("НалогСборИзменениеЗавершение", ЭтотОбъект, НовыйНалог);
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Будет выполнена очистка таблицы раздела 2. Продолжить?'"), 
		РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет, ,КодВозвратаДиалога.Нет);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогСборИзменениеЗавершение(Ответ, НовыйНалог) Экспорт 
	
	  Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		  Возврат
	  КонецЕсли;
	  
	  Объект.ВидНалогаИлиПлатежа = НовыйНалог;
	  
	  Объект.РасшифровкаПлатежа.Очистить();
	  
	  Модифицированность = Истина;
	  
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаСтатусСоставителяПриИзменении(Элемент)
	
	ЗаполнитьЗначенияСвойств(Объект, БухгалтерскийУчетКлиентСервер.НалоговыеРеквизитыПлатежногоДокумента(Новый Структура("СтатусСоставителя", ПолеВводаСтатусСоставителя)));
	
	БухгалтерскийУчетКлиентСервер.ЗаполнитьНезаполненныеНалоговыеРеквизиты(Объект, "СтатусСоставителя", ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем, Объект.Дата);

КонецПроцедуры

&НаКлиенте
Процедура СтатусСоставителяПриИзменении(Элемент)
	
	РеквизитыПлатежа = Новый Структура("СтатусСоставителя", Объект.СтатусСоставителя);
		
	ЗаполнитьЗначенияСвойств(ЭтаФорма, БухгалтерскийУчетКлиентСервер.ПолучитьЗначенияНалоговыхРеквизитов(РеквизитыПлатежа));

КонецПроцедуры

&НаКлиенте
Процедура УстановленныйСтатусДокументаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СтатусЭтогоДокументаНажатие(Элемент)
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ИсточникСредствНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИсточникиСредствПоКФО = СписокИсточниковСредствПоКФО.НайтиСтроки(Новый Структура("КФО",Объект.КФО));
	Если ИсточникиСредствПоКФО.Количество() > 0 Тогда
		Элементы.ИсточникСредств.СписокВыбора.ЗагрузитьЗначения(ИсточникиСредствПоКФО[0].СписокИсточников.ВыгрузитьЗначения());
	Иначе
		Элементы.ИсточникСредств.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзменении(Элемент)
	
	ИсточникиСредствПоКФО = СписокИсточниковСредствПоКФО.НайтиСтроки(Новый Структура("КФО",Объект.КФО));
	
	Если ИсточникиСредствПоКФО.Количество() > 0 Тогда
		СписокИСпоКФО = ИсточникиСредствПоКФО[0].СписокИсточников;
		Если СписокИСпоКФО.НайтиПоЗначению(Объект.ИсточникСредств) = Неопределено Тогда
			Объект.ИсточникСредств = "";
			Если СписокИСпоКФО.Количество() > 0 Тогда
				Объект.ИсточникСредств = СписокИСпоКФО[0].Значение;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Объект.ИсточникСредств = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КБКНазначениеПлатежаПриИзменении(Элемент)
		БухгалтерскийУчетКлиент.ПроверитьОчиститьКЭК(Объект.КБКНазначениеПлатежа, Объект.КОСГУНазначениеПлатежа); 	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаПлатежа

&НаКлиенте
Процедура РасшифровкаПлатежаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РасшифровкаПлатежаРеквизитыНалоговогоПлатежа" Тогда
		ОткрытьФормуНастройкиНалоговыхРеквизитов(ВыбраннаяСтрока);
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Поле.Имя = "РасшифровкаПлатежаРеквизитыПолучателяПлатежа" Тогда
		ОткрытьФормуНастройкиРеквизитовПолучателя(ВыбраннаяСтрока);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.РасшифровкаПлатежа.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНоваяСтрока Тогда
		
		ТекущаяКолонкаТаблицы = Элементы.РасшифровкаПлатежа.ТекущийЭлемент;
		ВыбраннаяСтрока = Элементы.РасшифровкаПлатежа.ТекущаяСтрока;
		
		Если ТекущаяКолонкаТаблицы.Имя = "РасшифровкаПлатежаРеквизитыНалоговогоПлатежа" Тогда
			
			ОткрытьФормуНастройкиНалоговыхРеквизитов(ВыбраннаяСтрока);
			
		ИначеЕсли ТекущаяКолонкаТаблицы.Имя = "РасшифровкаПлатежаРеквизитыПолучателяПлатежа" Тогда
			
			ОткрытьФормуНастройкиРеквизитовПолучателя(ВыбраннаяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ НоваяСтрока Тогда
		Возврат
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СуммаДокумента) Тогда
		Элемент.ТекущиеДанные.Сумма = Объект.СуммаДокумента - (Объект.РасшифровкаПлатежа.Итог("Сумма") - Элемент.ТекущиеДанные.Сумма);
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.РеквизитыНалоговогоПлатежа) Тогда
		Элемент.ТекущиеДанные.РеквизитыНалоговогоПлатежа = "<...>";
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.РеквизитыПолучателяПлатежа) Тогда
		Элемент.ТекущиеДанные.РеквизитыПолучателяПлатежа = "<...>";
	КонецЕсли;	
	
	Элемент.ТекущиеДанные.ИННПлательщика = ИННПлательщика;
	
	Элемент.ТекущиеДанные.КПППлательщика = КПППлательщика;

	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	РазницаИтогаТЧ = Объект.РасшифровкаПлатежа.Итог("Сумма") - Объект.СуммаДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РазницаИтогаТЧ = Объект.РасшифровкаПлатежа.Итог("Сумма") - Объект.СуммаДокумента;
	
	ЭтоНоваяСтрока = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПослеУдаления(Элемент)
	
	РазницаИтогаТЧ = Объект.РасшифровкаПлатежа.Итог("Сумма") - Объект.СуммаДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаНалогСборПлатежПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, РасшифровкаПлатежаНалогСборПлатежПриИзмененииНаСервере(ДанныеСтроки.НалогСборПлатеж));
	
	БухгалтерскийУчетКлиентСервер.ЗаполнитьНезаполненныеНалоговыеРеквизиты(ДанныеСтроки, "КодОКАТО,ПоказательОснования,ПоказательПериода,ПоказательНомера,ПоказательДаты,ПоказательТипа", ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем, Объект.Дата);
	
	ЗначенияРеквизитов = Новый Структура("КодОКАТО, ПоказательОснования, ПоказательПериода, ПоказательНомера, ПоказательДаты, ПоказательТипа");
	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, ДанныеСтроки);
	
	
	ДанныеСтроки.РеквизитыНалоговогоПлатежа = БухгалтерскийУчетКлиентСервер.ПредставлениеНалоговыхРеквизитов(ЗначенияРеквизитов);
	
	ПриИзмененииРеквизитовПолучателяНаКлиенте();
 
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаРеквизитыНалоговогоПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуНастройкиНалоговыхРеквизитов(Элементы.РасшифровкаПлатежа.ТекущаяСтрока);
	 
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаКонтрагентПриИзменении(Элемент)
	
	ПриИзмененииРеквизитовПолучателяНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСчетКонтрагентаПриИзменении(Элемент)
	
	ПриИзмененииРеквизитовПолучателяНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаРеквизитыПолучателяПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуНастройкиРеквизитовПолучателя(Элементы.РасшифровкаПлатежа.ТекущаяСтрока);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСуммуПлатежа(Команда)
	
	Объект.СуммаДокумента 			= Объект.РасшифровкаПлатежа.Итог("Сумма");
	РазницаИтогаТЧ 					= 0;

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьНазначениеПлатежа(Команда)
	
	СписокШаблонов = СписокШаблонов();
	
	Если СписокШаблонов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не найдено ни одного подходящего шаблона заполнения.'"));
	ИначеЕсли СписокШаблонов.Количество() = 1 Тогда
		ЗаполнитьНазначениеПлатежаНаКлиенте(СписокШаблонов[0], "");
	Иначе
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьНазначениеПлатежаНаКлиенте", ЭтотОбъект);
		СписокШаблонов.ПоказатьВыборЭлемента(Оповещение, "Выберите шаблон", СписокШаблонов[0]);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановленнаяДлинаНазначенияПлатежаКлиент()
		
	ДлинаПоля = СтрДлина(СокрП(Объект.НазначениеПлатежа));
	
	УстановленнаяДлинаНазначенияПлатежа = " " +  Формат(ДлинаПоля, "ЧЦ=3; ЧН=0; ЧГ=0")+ " симв., макс. " + Формат(УстановленнаяМаксимальнаяДлинаНазначенияПлатежа, "ЧЦ=3; ЧН=0; ЧГ=0") + " симв."
	+ ?(ДлинаПоля > УстановленнаяМаксимальнаяДлинаНазначенияПлатежа, ", превышение " + Формат(ДлинаПоля - УстановленнаяМаксимальнаяДлинаНазначенияПлатежа, "ЧЦ=3; ЧГ=0") + " симв.", "");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНазначениеПлатежаНаКлиенте(Шаблон, ДопПараметры) Экспорт
	
	Если Шаблон <> Неопределено Тогда
		НазначениеПлатежа(Шаблон.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРеквизитовОрганизации()

	ДоступностьРеквизитов = ЗначениеЗаполнено(Объект.Организация);
	Элементы.ЛицевойСчет.Доступность = ДоступностьРеквизитов;
	Элементы.Подразделение.Доступность = ДоступностьРеквизитов;
	Элементы.ПерваяПодпись.Доступность = ДоступностьРеквизитов;
	Элементы.ВтораяПодпись.Доступность = ДоступностьРеквизитов;

КонецПроцедуры // УстановитьДоступностьРеквизитовОрганизации()

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию();
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
	
		ИННКПП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Организация, "ИНН, КПП");
		ИННПлательщика = ИННКПП.ИНН;
		КПППлательщика = ИННКПП.КПП;
		
	Иначе
		
		ИННПлательщика = "";
		КПППлательщика = "";
		
	КонецЕсли;	
	
	Для Каждого Стр Из Объект.РасшифровкаПлатежа Цикл
		
		Если НЕ Стр.ИННПлательщика = ИННПлательщика Тогда
			Стр.ИННПлательщика = ИННПлательщика;
		КонецЕсли;
		
		Если НЕ Стр.КПППлательщика = КПППлательщика Тогда
			Стр.КПППлательщика = КПППлательщика;
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры	
	
&НаСервере
Процедура ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию()
	
	Умолчания = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(Объект.Организация, "Документ.СводнаяЗаявкаНаКассовыйРасход", Объект.Дата, Перечисления.ТипыЛицевыхСчетов.Казначейский);
	
	Объект.ЛицевойСчет 				= Умолчания.ЛицевойСчет;
	Объект.РеквизитыЛицевогоСчета 	= Умолчания.РеквизитыЛицевогоСчета;
	Объект.ОрганКазначейства		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "КассовыйОрган");
	
	ПриИзмененииЛицевогоСчета();
	
КонецПроцедуры	

&НаСервере
Процедура ПолучитьЛицевойСчетОрганКазначейства()
	
	Объект.ЛицевойСчет 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "Владелец");
	Объект.ОрганКазначейства		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "КассовыйОрган");
	
   	ПриИзмененииЛицевогоСчета();

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииЛицевогоСчета()
	
	Перем ДопустимыеИсточникиСредств;

   	СвойстваЛицевогоСчета 		= ПлатежноРасчетныеДокументыПовтИсп.ПолучитьСвойстваЛицевогоСчета(Объект.ЛицевойСчет, Объект.Дата); 
	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) тогда
		Объект.ПерваяПодпись				 	= СвойстваЛицевогоСчета.ПерваяПодпись;
		Объект.ВтораяПодпись 					= СвойстваЛицевогоСчета.ВтораяПодпись;
		Объект.ВтораяПодписьПечататьДолжность 	= СвойстваЛицевогоСчета.ВтораяПодписьПечататьДолжность;
		Объект.ПерваяПодписьПечататьДолжность 	= СвойстваЛицевогоСчета.ПерваяПодписьПечататьДолжность;
		Объект.ПерваяПодписьДолжность         	= СвойстваЛицевогоСчета.ПерваяПодписьДолжность;
		Объект.ВтораяПодписьДолжность		  	= СвойстваЛицевогоСчета.ВтораяПодписьДолжность;
		
		Если СвойстваЛицевогоСчета.Свойство("НеЗаполнятьПредельнуюДатуИсполнения") И НЕ СвойстваЛицевогоСчета.НеЗаполнятьПредельнуюДатуИсполнения Тогда
			Объект.ПредельнаяДатаИсполнения = КонецДня(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса())) + СвойстваЛицевогоСчета.ПредельныйСрокИсполненияЗаявок;
		КонецЕсли;	
		
		
	Иначе
		Объект.ВтораяПодписьПечататьДолжность 	= Ложь;
		Объект.ПерваяПодписьПечататьДолжность 	= Ложь;
		Объект.ПерваяПодписьДолжность         	= "";
		Объект.ВтораяПодписьДолжность		  	= "";
		Объект.ОрганКазначейства				= "";
	КонецЕсли;	
	
	Элементы.ИсточникСредств.СписокВыбора.ЗагрузитьЗначения(ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(Объект.ЛицевойСчет));
	
	ПлатежноРасчетныеДокументы.ЗаполнитьДопустимыеКФОиИсточникиСредств(Объект.ЛицевойСчет,СписокДопустимыхКФО,СписокИсточниковСредствПоКФО);
	
	Если СписокДопустимыхКФО.НайтиПоЗначению(Объект.КФО) = Неопределено Тогда
		Объект.КФО = "";
		Если СписокДопустимыхКФО.Количество() > 0 Тогда
			Объект.КФО = СписокДопустимыхКФО[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	ДопустимыеИсточникиСредств = ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(Объект.ЛицевойСчет,Объект.КФО);
	Если ДопустимыеИсточникиСредств.Найти(Объект.ИсточникСредств) = Неопределено Тогда
		Объект.ИсточникСредств = "";
		Если ДопустимыеИсточникиСредств.Количество() > 0 Тогда
			Объект.ИсточникСредств = ДопустимыеИсточникиСредств[0];
		КонецЕсли;
	КонецЕсли; 
	
	УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЛицевойСчет, "МаксДлинаНазначенияПлатежа");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьДолжность(Знач Подпись, ПодписьПечататьДолжность, Дата)
	
	Возврат ПлатежноРасчетныеДокументыПовтИсп.ПолучитьДолжностьСотрудника(Подпись, ПодписьПечататьДолжность, Дата);
	
КонецФункции

&НаСервере
Процедура НалогСборПриИзмененииНаСервере()
	
	НалоговыеНастройки = БухгалтерскийУчет.ПолучитьНастройкиВидаНалоговогоПлатежа(Объект.ВидНалогаИлиПлатежа, Объект.Дата, Объект.Организация);
	
	ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем = НалоговыеНастройки.ЗаполнятьНезаполненныеНулем;
	ТаможенныйПлатеж = НалоговыеНастройки.ТаможенныйПлатеж;
	
	Объект.КодБКНалога = НалоговыеНастройки.КодБКНалога;
	Объект.СтатусСоставителя = НалоговыеНастройки.СтатусСоставителя;
	Объект.ОчередностьПлатежа  = НалоговыеНастройки.ОчередностьПлатежа;
	
	РеквизитыПлатежа = Новый Структура("СтатусСоставителя", Объект.СтатусСоставителя);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, БухгалтерскийУчетКлиентСервер.ПолучитьЗначенияНалоговыхРеквизитов(Новый Структура("СтатусСоставителя", Объект.СтатусСоставителя)));
	
КонецПроцедуры		

&НаСервере
Функция РасшифровкаПлатежаНалогСборПлатежПриИзмененииНаСервере(ДанныеСтрокиНалогСборПлатеж)
	
	 	
	НастройкаНалоговыхРеквизитов = БухгалтерскийУчет.ПолучитьНастройкиНалоговогоПлатежа(ДанныеСтрокиНалогСборПлатеж);
	
	//ПоказательОснования, ПоказательТипа, ИННПлательщика, КПППлательщика, Контрагент, СчетКонтрагента
	ЗаполнитьЗначенияСвойств(НастройкаНалоговыхРеквизитов, БухгалтерскийУчетКлиентСервер.НалоговыеРеквизитыПлатежногоДокумента(НастройкаНалоговыхРеквизитов)); 

	// КодОКТМО, КодОКАТО 
	НастройкаНалоговыхРеквизитов.КодОКАТО = БухгалтерскийУчетКлиентСервер.ОКАТООКТМОПоДате(Объект.Дата, НастройкаНалоговыхРеквизитов.КодОКАТО, НастройкаНалоговыхРеквизитов.КодОКТМО); 
	
	НастройкаНалоговыхРеквизитов.Вставить("СтрокаНазначениеПлатежа", НастройкаНалоговыхРеквизитов.ТекстНазначенияПлатежа);
	
	// ПоказательПериода, КодТаможенногоОргана
	ЗначенияРеквизитов = Новый Структура("ПоказательПериода, ПолеВводаГодПериода, ПолеВводаНомерПериода, ПолеВводаДатаПериода"); 
	ЗначенияРеквизитов.Вставить("ПолеВводаКодТаможенногоОргана", НастройкаНалоговыхРеквизитов.КодТаможенногоОргана);
    БухгалтерскийУчетКлиентСервер.ОпределитьРеквизитыНалоговогоПериода(НастройкаНалоговыхРеквизитов.ПоказательПериода, ТаможенныйПлатеж, Объект.Дата, ЗначенияРеквизитов);
	ЗаполнитьЗначенияСвойств(НастройкаНалоговыхРеквизитов, ЗначенияРеквизитов);
	
	Возврат НастройкаНалоговыхРеквизитов;

КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНастройкиНалоговыхРеквизитов(ВыбраннаяСтрокаТаблицы)

	Если ВыбраннаяСтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДанныеСтроки = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ВыбраннаяСтрокаТаблицы);
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыПлатежа = Новый Структура("ВидНалогаИлиПлатежа, СтатусСоставителя, КодБКНалога, НалогСборПлатеж,
		|КодОКАТО, ПоказательОснования, ПоказательПериода, ПоказательНомера, ПоказательДаты, ПоказательТипа, Дата");
	ЗаполнитьЗначенияСвойств(РеквизитыПлатежа, Объект);
	ЗаполнитьЗначенияСвойств(РеквизитыПлатежа, ДанныеСтроки); 
	
	РеквизитыПлатежа.Вставить("ТаможенныйПлатеж", ТаможенныйПлатеж);
	РеквизитыПлатежа.Вставить("ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем", ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем);

	НедоступныеРеквизиты = Новый Массив;
	НедоступныеРеквизиты.Добавить("НалогСборПлатеж");
	НедоступныеРеквизиты.Добавить("СтатусСоставителя");
	НедоступныеРеквизиты.Добавить("КодБКНалога");
	
	ПараметрыОткрытия = Новый Структура("РеквизитыПлатежа, НедоступныеРеквизиты", РеквизитыПлатежа, НедоступныеРеквизиты);
	
	ОткрытьФорму("ОбщаяФорма.ВводРеквизитовНалоговогоПлатежа", ПараметрыОткрытия, ЭтаФорма);

КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаВыбораНалоговыхРеквизитовНаКлиенте(НалоговыеРеквизиты)
	
	ДанныеСтроки = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, НалоговыеРеквизиты);
	
	ЗначенияРеквизитов = Новый Структура("КодОКАТО, ПоказательОснования, ПоказательПериода, ПоказательНомера, ПоказательДаты, ПоказательТипа");
	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, ДанныеСтроки);
	
	ДанныеСтроки.РеквизитыНалоговогоПлатежа = БухгалтерскийУчетКлиентСервер.ПредставлениеНалоговыхРеквизитов(ЗначенияРеквизитов);
    	
	Модифицированность = Истина;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииРеквизитовПолучателяНаКлиенте();
	
	ДанныеСтроки = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	РеквизитыПолучателя = РасшифровкаПлатежаПолучательПриИзмененииНаСервере(ДанныеСтроки.Контрагент, ДанныеСтроки.СчетКонтрагента);
	
	РеквизитыПолучателя.Вставить("РеквизитыПолучателяПлатежа", КорреспондентыКлиентСервер.ПлатежныеРеквизитыКорреспондентаСтрокой(РеквизитыПолучателя));
	
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, РеквизитыПолучателя);
	
КонецПроцедуры	

&НаСервере
Функция РасшифровкаПлатежаПолучательПриИзмененииНаСервере(ДанныеСтрокиКонтрагент, ДанныеСтрокиСчетКонтрагента)
	
	РеквизитыПолучателя = Новый Структура("КонтрагентИНН, КонтрагентКПП, КонтрагентНаименование, КонтрагентБанковскийСчет, КонтрагентНаименованиеБанка, КонтрагентБИКБанка, КонтрагентКорСчетБанка",
	"ИНН", "КПП", "Корреспондент", "СчетНомер", "Банк", "БИК", "КоррСчет");
	                                                                                                                                    
	ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(ДанныеСтрокиСчетКонтрагента, ДанныеСтрокиСчетКонтрагента, РеквизитыПолучателя, , Ложь);

	Возврат РеквизитыПолучателя;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНастройкиРеквизитовПолучателя(ВыбраннаяСтрокаТаблицы)
	
	Если ВыбраннаяСтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ВыбраннаяСтрокаТаблицы);
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	ПлатежныеРеквизиты = Новый Структура;
	ПлатежныеРеквизиты.Вставить("БанковскийСчет", 	ДанныеСтроки.КонтрагентБанковскийСчет);
	ПлатежныеРеквизиты.Вставить("БИКБанка", 		ДанныеСтроки.КонтрагентБИКБанка);
	ПлатежныеРеквизиты.Вставить("ИНН", 				ДанныеСтроки.КонтрагентИНН);
	ПлатежныеРеквизиты.Вставить("КорСчетБанка", 	ДанныеСтроки.КонтрагентКорСчетБанка);
	ПлатежныеРеквизиты.Вставить("КПП", 				ДанныеСтроки.КонтрагентКПП);
	ПлатежныеРеквизиты.Вставить("НаименованиеБанка",ДанныеСтроки.КонтрагентНаименованиеБанка);
	ПлатежныеРеквизиты.Вставить("Наименование", 	ДанныеСтроки.КонтрагентНаименование);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", 	"Реквизиты получателя платежа"); 
	ПараметрыФормы.Вставить("КлючДанных", "Получатель");
	ПараметрыФормы.Вставить("ПлатежныеРеквизиты", 	ПлатежныеРеквизиты); 

			
	ОткрытьФорму("ОбщаяФорма.РедактированиеПлатежныхРеквизитов", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРеквизитовПолучателяНаКлиенте(РеквизитыПолучателя)
	
	ДанныеСтроки = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	ДанныеСтроки.КонтрагентБанковскийСчет 		= РеквизитыПолучателя.БанковскийСчет;
	ДанныеСтроки.КонтрагентБИКБанка				= РеквизитыПолучателя.БИКБанка;
	ДанныеСтроки.КонтрагентИНН					= РеквизитыПолучателя.ИНН;
	ДанныеСтроки.КонтрагентКорСчетБанка			= РеквизитыПолучателя.КорСчетБанка;
	ДанныеСтроки.КонтрагентКПП					= РеквизитыПолучателя.КПП;
	ДанныеСтроки.КонтрагентНаименованиеБанка	= РеквизитыПолучателя.НаименованиеБанка;
	ДанныеСтроки.КонтрагентНаименование			= РеквизитыПолучателя.Наименование;

	ДанныеСтроки.РеквизитыПолучателяПлатежа 	= КорреспондентыКлиентСервер.ПлатежныеРеквизитыКорреспондентаСтрокой(ДанныеСтроки);
		
	Модифицированность = Истина;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТекстовыеКолонкиРасшифровки()
	
	ЗначенияРеквизитов = Новый Структура("КодОКАТО, ПоказательОснования, ПоказательПериода, ПоказательНомера, ПоказательДаты, ПоказательТипа");
	РеквизитыПолучателя = Новый Структура("КонтрагентИНН, КонтрагентКПП, КонтрагентНаименование, КонтрагентБанковскийСчет, КонтрагентНаименованиеБанка, КонтрагентБИКБанка, КонтрагентКорСчетБанка");
	
	Для Каждого СтрокаРасшифровки Из Объект.РасшифровкаПлатежа Цикл
		
		//Налоговые реквизиты
	    ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, СтрокаРасшифровки);
		СтрокаРасшифровки.РеквизитыНалоговогоПлатежа = БухгалтерскийУчетКлиентСервер.ПредставлениеНалоговыхРеквизитов(ЗначенияРеквизитов);
		
		//Реквизиты получателя
		ЗаполнитьЗначенияСвойств(РеквизитыПолучателя, СтрокаРасшифровки);
		СтрокаРасшифровки.РеквизитыПолучателяПлатежа = КорреспондентыКлиентСервер.ПлатежныеРеквизитыКорреспондентаСтрокой(РеквизитыПолучателя);
		
	КонецЦикла;	

	
КонецПроцедуры	
 
&НаКлиенте
Процедура ИзменитьСтатусДокумента()
	
	ПлатежноРасчетныеДокументыКлиент.ОткрытьФормуИзмененияСтатусаДокумента(ЭтаФорма);
	
КонецПроцедуры	

&НаСервере
Функция СписокШаблонов()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	СписокШаблонов = Справочники.ШаблоныЗаполненияПП.ПолучитьСписокШаблонов(ДокОбъект);
	
	Возврат СписокШаблонов;
	
КонецФункции

&НаСервере
Процедура НазначениеПлатежа(ВыбранныйШаблон)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Шаблон = ВыбранныйШаблон.ПолучитьОбъект();
	Объект.НазначениеПлатежа = Шаблон.СформироватьНазначениеПлатежа(ДокОбъект);
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПлатежаПриИзменении(Элемент)
	УстановленнаяДлинаНазначенияПлатежаКлиент();
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

ЭтоНоваяСтрока = Ложь;
